// Найти квадрат целого числа
// 1.Ввод целого числа
// 2.Нахождение квадрата целого числа 
Console.WriteLine("Введите целое число для нахождения его квадарата : ");
int number = Convert.ToInt32(Console.ReadLine());
int square = number*number;
Console.WriteLine($"Квадрта числа {number} = {square}");
